In [4]:
import numpy as np
import pandas as pd

In [1]:
# In Pandas NaN and None are treated as floating type

'''
There are methods defined to operate with Null values:

-isnull()
-notnull()
-dropna()
-fillna()
'''

'\nThere are methods defined to operate with Null values:\n\n-isnull()\n-notnull()\n-dropna()\n-fillna()\n'

In [5]:
# isnull() and notnull()

data = pd.Series([1, np.nan, 'hello', None])
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [6]:
data.isnull()

0    False
1     True
2    False
3     True
dtype: bool

In [7]:
data.notnull()

0     True
1    False
2     True
3    False
dtype: bool

In [9]:
# Find values that are null
data[data.isnull()]

1     NaN
3    None
dtype: object

In [10]:
# Find values that are not-null
data[data.notnull()]

0        1
2    hello
dtype: object

In [11]:
#--
# Dropping null values using -> dropna()

data.dropna()

0        1
2    hello
dtype: object

In [12]:
data

0        1
1      NaN
2    hello
3     None
dtype: object

In [13]:
df = pd.DataFrame([
    [1, np.nan, 2],
    [2, 3, 5],
    [np.nan, 4, 6]
])

df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [14]:
df.isnull()

       0      1      2
0  False   True  False
1  False  False  False
2   True  False  False

In [15]:
df.notnull()

       0      1     2
0   True  False  True
1   True   True  True
2  False   True  True

In [16]:
# Note: In a dataframe .dropna() will drop an entire row that
# has a NaN value
df.dropna()

     0    1  2
1  2.0  3.0  5

In [17]:
df.dropna(axis = 1)

   2
0  2
1  5
2  6

In [18]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [19]:
df.dropna(axis = 0)

     0    1  2
1  2.0  3.0  5

In [20]:
df

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [22]:
df[3] = np.nan
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [25]:
df.dropna(axis = 'columns', how='all')

     0    1  2
0  1.0  NaN  2
1  2.0  3.0  5
2  NaN  4.0  6

In [30]:
df.dropna(axis = 'rows', thresh=3)
# Thresh defines how many non-null values should row have

     0    1  2   3
1  2.0  3.0  5 NaN

In [31]:
# Using fillna() in pd Series

data = pd.Series(
    [1, np.nan, 2, None, 3],
    index = list('ABCDE')
)

data

A    1.0
B    NaN
C    2.0
D    NaN
E    3.0
dtype: float64

In [32]:
# Replace NaN with zeroes using fillna(0)

data.fillna(0)

A    1.0
B    0.0
C    2.0
D    0.0
E    3.0
dtype: float64

In [33]:
data

A    1.0
B    NaN
C    2.0
D    NaN
E    3.0
dtype: float64

In [34]:
data = data.fillna(0)

In [35]:
data

A    1.0
B    0.0
C    2.0
D    0.0
E    3.0
dtype: float64

In [36]:
data = pd.Series(
    [1, np.nan, 2, None, 3],
    index = list('ABCDE')
)

In [37]:
# fillna(mathod=bfill) fills the NA value from the previous value

data.fillna(method='bfill')

A    1.0
B    2.0
C    2.0
D    3.0
E    3.0
dtype: float64

In [39]:
# dillna(method='ffill') is forward fill. Assumes the value of the next

data.fillna(method='ffill')

A    1.0
B    1.0
C    2.0
D    2.0
E    3.0
dtype: float64

In [40]:
df

     0    1  2   3
0  1.0  NaN  2 NaN
1  2.0  3.0  5 NaN
2  NaN  4.0  6 NaN

In [43]:
df.fillna(method='ffill', axis='1')

ValueError: No axis named 1 for object type <class 'pandas.core.frame.DataFrame'>